historic/direct/azure_g5_ssd/mixed-13-1to4k_40Mseq.fio.out
randread-1k: (g=0): rw=randread, bs=1K-4K/1K-4K/1K-4K, ioengine=libaio, iodepth=10
seqread: (g=0): rw=read, bs=1M-1M/1M-1M/1M-1M, ioengine=libaio, iodepth=10
seqwrite: (g=0): rw=write, bs=1M-1M/1M-1M/1M-1M, ioengine=libaio, iodepth=10
fio-2.1.3
Starting 3 processes

randread-1k: (groupid=0, jobs=1): err= 0: pid=3695: Wed Apr  8 14:13:49 2015
  read : io=6072.4MB, bw=103633KB/s, iops=49994, runt= 60001msec
    slat (usec): min=1, max=1493, avg= 3.67, stdev= 5.41
    clat (usec): min=34, max=9122, avg=194.22, stdev=98.09
     lat (usec): min=47, max=9127, avg=198.53, stdev=98.89
    clat percentiles (usec):
     |  1.00th=[  129],  5.00th=[  143], 10.00th=[  151], 20.00th=[  161],
     | 30.00th=[  169], 40.00th=[  175], 50.00th=[  183], 60.00th=[  189],
     | 70.00th=[  199], 80.00th=[  211], 90.00th=[  233], 95.00th=[  262],
     | 99.00th=[  474], 99.50th=[  540], 99.90th=[ 1784], 99.95th=[ 2128],
     | 99.99th=[ 2800]
    bw (KB  /s): min=85670, max=124828, per=72.08%, avg=104273.69, stdev=9919.99
    lat (usec) : 50=0.01%, 100=0.24%, 250=93.37%, 500=5.63%, 750=0.54%
    lat (usec) : 1000=0.03%
    lat (msec) : 2=0.14%, 4=0.06%, 10=0.01%
  cpu          : usr=5.28%, sys=34.16%, ctx=1159154, majf=0, minf=221
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=100.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.1%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued    : total=r=2999695/w=0/d=0, short=r=0/w=0/d=0
seqread: (groupid=0, jobs=1): err= 0: pid=3696: Wed Apr  8 14:13:49 2015
  read : io=2406.0MB, bw=41056KB/s, iops=40, runt= 60010msec
    slat (usec): min=48, max=1576, avg=112.42, stdev=69.66
    clat (usec): min=479, max=5878, avg=744.52, stdev=274.19
     lat (usec): min=550, max=7456, avg=857.98, stdev=313.49
    clat percentiles (usec):
     |  1.00th=[  502],  5.00th=[  524], 10.00th=[  540], 20.00th=[  572],
     | 30.00th=[  732], 40.00th=[  748], 50.00th=[  764], 60.00th=[  772],
     | 70.00th=[  780], 80.00th=[  796], 90.00th=[  820], 95.00th=[  852],
     | 99.00th=[ 1896], 99.50th=[ 2480], 99.90th=[ 4576], 99.95th=[ 5664],
     | 99.99th=[ 5856]
    bw (KB  /s): min=40796, max=44966, per=28.40%, avg=41087.30, stdev=631.01
    lat (usec) : 500=0.79%, 750=40.15%, 1000=57.56%
    lat (msec) : 2=0.50%, 4=0.83%, 10=0.17%
  cpu          : usr=0.00%, sys=2.62%, ctx=4766, majf=0, minf=526
  IO depths    : 1=98.8%, 2=0.2%, 4=0.5%, 8=0.5%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued    : total=r=2406/w=0/d=0, short=r=0/w=0/d=0
seqwrite: (groupid=0, jobs=1): err= 0: pid=3697: Wed Apr  8 14:13:49 2015
  write: io=2406.0MB, bw=41060KB/s, iops=40, runt= 60004msec
    slat (usec): min=49, max=1074, avg=128.87, stdev=56.26
    clat (usec): min=254, max=3109, avg=424.25, stdev=217.72
     lat (usec): min=416, max=3329, avg=554.45, stdev=233.78
    clat percentiles (usec):
     |  1.00th=[  350],  5.00th=[  362], 10.00th=[  366], 20.00th=[  374],
     | 30.00th=[  382], 40.00th=[  390], 50.00th=[  394], 60.00th=[  402],
     | 70.00th=[  410], 80.00th=[  418], 90.00th=[  438], 95.00th=[  482],
     | 99.00th=[ 1544], 99.50th=[ 2352], 99.90th=[ 3056], 99.95th=[ 3088],
     | 99.99th=[ 3120]
    bw (KB  /s): min=40882, max=44966, per=100.00%, avg=41088.24, stdev=640.60
    lat (usec) : 500=96.05%, 750=2.45%, 1000=0.04%
    lat (msec) : 2=0.75%, 4=0.71%
  cpu          : usr=0.38%, sys=2.32%, ctx=4777, majf=0, minf=318
  IO depths    : 1=98.7%, 2=0.2%, 4=0.5%, 8=0.5%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued    : total=r=0/w=2406/d=0, short=r=0/w=0/d=0

Run status group 0 (all jobs):
   READ: io=8478.4MB, aggrb=144673KB/s, minb=41055KB/s, maxb=103633KB/s, mint=60001msec, maxt=60010msec
  WRITE: io=2406.0MB, aggrb=41059KB/s, minb=41059KB/s, maxb=41059KB/s, mint=60004msec, maxt=60004msec

Disk stats (read/write):
  sdb: ios=3008431/19200, merge=0/12, ticks=542616/14452, in_queue=557152, util=99.98%