historic/direct/azure_g5_ssd/mixed-21-8to16k_10Mseq.fio.out
randread-1k: (g=0): rw=randread, bs=8K-16K/8K-16K/8K-16K, ioengine=libaio, iodepth=10
seqread: (g=0): rw=read, bs=1M-1M/1M-1M/1M-1M, ioengine=libaio, iodepth=10
seqwrite: (g=0): rw=write, bs=1M-1M/1M-1M/1M-1M, ioengine=libaio, iodepth=10
fio-2.1.3
Starting 3 processes

randread-1k: (groupid=0, jobs=1): err= 0: pid=3802: Wed Apr  8 14:17:51 2015
  read : io=27170MB, bw=463696KB/s, iops=42945, runt= 60001msec
    slat (usec): min=1, max=2379, avg= 3.95, stdev= 4.65
    clat (usec): min=37, max=8269, avg=226.75, stdev=68.93
     lat (usec): min=55, max=8275, avg=231.33, stdev=69.52
    clat percentiles (usec):
     |  1.00th=[  161],  5.00th=[  175], 10.00th=[  183], 20.00th=[  193],
     | 30.00th=[  201], 40.00th=[  211], 50.00th=[  219], 60.00th=[  227],
     | 70.00th=[  239], 80.00th=[  253], 90.00th=[  278], 95.00th=[  298],
     | 99.00th=[  370], 99.50th=[  450], 99.90th=[  724], 99.95th=[ 1512],
     | 99.99th=[ 2512]
    bw (KB  /s): min=434176, max=505712, per=99.02%, avg=469293.89, stdev=19402.53
    lat (usec) : 50=0.01%, 100=0.01%, 250=78.07%, 500=21.57%, 750=0.26%
    lat (usec) : 1000=0.02%
    lat (msec) : 2=0.05%, 4=0.02%, 10=0.01%
  cpu          : usr=4.50%, sys=31.34%, ctx=1293334, majf=0, minf=256
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=100.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.1%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued    : total=r=2576757/w=0/d=0, short=r=0/w=0/d=0
seqread: (groupid=0, jobs=1): err= 0: pid=3803: Wed Apr  8 14:17:51 2015
  read : io=616448KB, bw=10274KB/s, iops=10, runt= 60002msec
    slat (usec): min=44, max=2414, avg=116.73, stdev=155.69
    clat (usec): min=504, max=6457, avg=773.09, stdev=439.33
     lat (usec): min=557, max=7746, avg=890.92, stdev=528.44
    clat percentiles (usec):
     |  1.00th=[  524],  5.00th=[  548], 10.00th=[  556], 20.00th=[  604],
     | 30.00th=[  724], 40.00th=[  756], 50.00th=[  764], 60.00th=[  780],
     | 70.00th=[  788], 80.00th=[  804], 90.00th=[  820], 95.00th=[  844],
     | 99.00th=[ 1896], 99.50th=[ 4704], 99.90th=[ 6432], 99.95th=[ 6432],
     | 99.99th=[ 6432]
    bw (KB  /s): min=10219, max=12275, per=2.17%, avg=10266.29, stdev=196.24
    lat (usec) : 750=38.21%, 1000=59.97%
    lat (msec) : 2=0.83%, 4=0.33%, 10=0.66%
  cpu          : usr=0.57%, sys=3.67%, ctx=1216, majf=0, minf=3088
  IO depths    : 1=98.5%, 2=0.3%, 4=0.7%, 8=0.5%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued    : total=r=602/w=0/d=0, short=r=0/w=0/d=0
seqwrite: (groupid=0, jobs=1): err= 0: pid=3804: Wed Apr  8 14:17:51 2015
  write: io=616448KB, bw=10274KB/s, iops=10, runt= 59999msec
    slat (usec): min=49, max=530, avg=112.95, stdev=53.97
    clat (usec): min=341, max=3462, avg=439.91, stdev=250.40
     lat (usec): min=431, max=3786, avg=554.15, stdev=283.41
    clat percentiles (usec):
     |  1.00th=[  350],  5.00th=[  366], 10.00th=[  374], 20.00th=[  386],
     | 30.00th=[  390], 40.00th=[  398], 50.00th=[  406], 60.00th=[  414],
     | 70.00th=[  422], 80.00th=[  434], 90.00th=[  458], 95.00th=[  482],
     | 99.00th=[ 2096], 99.50th=[ 2192], 99.90th=[ 3472], 99.95th=[ 3472],
     | 99.99th=[ 3472]
    bw (KB  /s): min=10240, max=12275, per=99.93%, avg=10266.49, stdev=196.18
    lat (usec) : 500=95.85%, 750=2.49%
    lat (msec) : 2=0.50%, 4=1.16%
  cpu          : usr=0.75%, sys=2.26%, ctx=1191, majf=0, minf=9
  IO depths    : 1=98.5%, 2=0.3%, 4=0.7%, 8=0.5%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued    : total=r=0/w=602/d=0, short=r=0/w=0/d=0

Run status group 0 (all jobs):
   READ: io=27772MB, aggrb=473962KB/s, minb=10273KB/s, maxb=463696KB/s, mint=60001msec, maxt=60002msec
  WRITE: io=616448KB, aggrb=10274KB/s, minb=10274KB/s, maxb=10274KB/s, mint=59999msec, maxt=59999msec

Disk stats (read/write):
  sdb: ios=2576211/4824, merge=0/12, ticks=558720/92, in_queue=558836, util=99.97%